vovaok/stm32-plus-plus/src/gfx/dma2d.h
#pragma once

#include "stm32.h"
#include "framebuffer.h"
#include "image.h"

#if defined(DMA2D)

class Dma2D
{
public:
    Dma2D(FrameBuffer *frameBuffer, int x=0, int y=0);

    // must be called BEFORE setSource!
    void setSize(int width, int height);

    void setSource(uint32_t color, int width, int height);
    void setSource(const uint8_t *data, int width, int height);
    void setSource(const uint8_t *data, int width, int height, PixelFormat fmt);
    void setSource(const FrameBuffer *fb, int x=0, int y=0);
    void setSource(const FrameBuffer *foreground, const FrameBuffer *background);

    void start();
    void wait();

    void doTransfer() {start(); wait();}

private:
    FrameBuffer *m_fb;
    int m_maxw, m_maxh;

    enum Mode
    {
        Mode_Mem2Mem = 0 << DMA2D_CR_MODE_Pos,
        Mode_Mem2MemPfc = 1 << DMA2D_CR_MODE_Pos,
        Mode_Mem2MemBlend = 2 << DMA2D_CR_MODE_Pos,
        Mode_Reg2Mem = 3 << DMA2D_CR_MODE_Pos
    };
};

#endif